### creating new column

In [4]:
import numpy as np
import pandas as pd

In [5]:
a=np.random.randint(10,50,(5,5))

In [6]:
a

array([[44, 23, 10, 31, 37],
       [25, 43, 20, 46, 46],
       [44, 23, 14, 26, 22],
       [15, 25, 11, 27, 16],
       [16, 32, 30, 10, 32]])

In [8]:
df=pd.DataFrame(a,['A','B','C','D','E'],['Z','Y','X','W','V'])

In [9]:
df

    Z   Y   X   W   V
A  44  23  10  31  37
B  25  43  20  46  46
C  44  23  14  26  22
D  15  25  11  27  16
E  16  32  30  10  32

In [10]:
df['W+V']=df['W']+df['V']

In [11]:
df

    Z   Y   X   W   V  W+V
A  44  23  10  31  37   68
B  25  43  20  46  46   92
C  44  23  14  26  22   48
D  15  25  11  27  16   43
E  16  32  30  10  32   42

### Dropping a column

In [13]:
df.drop('W+V',axis=1)

    Z   Y   X   W   V
A  44  23  10  31  37
B  25  43  20  46  46
C  44  23  14  26  22
D  15  25  11  27  16
E  16  32  30  10  32

In [14]:
df

    Z   Y   X   W   V  W+V
A  44  23  10  31  37   68
B  25  43  20  46  46   92
C  44  23  14  26  22   48
D  15  25  11  27  16   43
E  16  32  30  10  32   42

### For droping permently

In [19]:
df.drop('W+V',axis=1,inplace=True)

In [20]:
df

    Z   Y   X   W   V
A  44  23  10  31  37
B  25  43  20  46  46
C  44  23  14  26  22
D  15  25  11  27  16
E  16  32  30  10  32

### Accessing the row in column base

In [22]:
df.loc['B']

Z    25
Y    43
X    20
W    46
V    46
Name: B, dtype: int32

In [23]:
df.iloc[1]

Z    25
Y    43
X    20
W    46
V    46
Name: B, dtype: int32

In [24]:
#For selecting Z values that are less than 30
df['Z'][df['Z']<30]

B    25
D    15
E    16
Name: Z, dtype: int32

In [28]:
df[['Z','Y']][(df['Z']<30) & (df['Z']>15)]

    Z   Y
B  25  43
E  16  32